/**
 * Copyright 2025 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

// Do not modify this file by hand!
// Re-generate this file by running lit-localize

import {str} from '@lit/localize';

/* eslint-disable no-irregular-whitespace */
/* eslint-disable @typescript-eslint/no-explicit-any */

export const templates = {
  s02c64e6a6306c0b0: 'Добавить рекламное место',
  s0536dee760be4bf2: '// Задает настройки конфиденциальности.',
  s08995feb9716ee48: 'Формат внестраничного объявления',
  s09c694b6602d365d: 'Боковое объявление (слева)',
  s0d576da69783c058: str`${0}: возвращается пустое значение, если страница или устройство не поддерживает их.`,
  s0eb106f4b9813ad3: 'Неперсонализированная реклама',
  s1163c710c6c9bccf: 'Межстраничное объявление в играх',
  s11a3c998dc1af0b1: 'Образцы объявлений',
  s1c59de6a71660855: 'Добавить размер',
  s267a52c34c200ef0: 'Режим единого запроса (РЕЗ)',
  s292d08a9cea72454: 'Объявление гибкого размера',
  s2d647200b120ea41: 'Путь к рекламному блоку',
  s3132d1a0580760bc: 'Ресурс для детей',
  s3400fb34f1e245a9: 'Объявление с несколькими размерами',
  s34774a88f199f364: '// Задает параметры таргетинга на уровне страницы.',
  s352f8b213acc822a: str`${0}: загрузка выполнена.`,
  s3be169991df10a5d: 'Посмотреть',
  s3e0b42b56e05829d: 'Размеры',
  s4121536e35beb2ed: 'Объявление фиксированного размера (728 x 90)',
  s43e9aef7aa01fca9: 'Недоступно',
  s4535f519744108bf: 'Формат вывода',
  s4661d2a8c1259e58: 'Образцы внестраничных объявлений',
  s48390e2c954ba495: 'Объявление фиксированного размера (100 x 100)',
  s506b6a19d12f414c: 'Ключ',
  s57472465a23b41db: 'Значения',
  s5bf3f3d517569ebd: 'Фиксированное объявление (внизу)',
  s5e13187e6961d8b1: '// Определяет внестраничные рекламные места.',
  s5ec0955e7a33abf4: '// Включает режим единого запроса.',
  s5fc316a7f287b7be: 'Просмотр в окне iframe невозможен.',
  s669b18c6d2d9c95b: 'Нет',
  s703415876ae4626f: 'Объявление фиксированного размера (750 x 200)',
  s707a334b3b2a7140: str`${0}. Чтобы выполнить просмотр в отдельном окне, нажмите кнопку ниже.`,
  s710f900ef624e363: 'Фиксированное объявление (вверху)',
  s716e903e2945c8cb: 'Удалить значение таргетинга',
  s71e012bd812c44a2: '// Определяет статические рекламные места.',
  s758d8c59379ea482: 'Таргетинг на уровне страницы',
  s77b0113eae08368b: 'Образец шаблона',
  s7b5fa742d13b462e: 'Настройки рекламного места',
  s7d28e0b73aced2d9: 'Пример конфигурации',
  s8233e942045a2b50: str`${0} не поддерживается на этой странице.`,
  s8a2c4a3aa651b7fb: 'Удалить рекламное место',
  s90465cbd227840a3: str`${0} Чтобы активировать, прокрутите страницу.`,
  s9691600b4b891cf3: 'Гибкий',
  s9d21580cc7643953: str`${0} загружается…`,
  sb457d189f407a5a6: 'Отказаться от обработки пользовательских данных',
  sb55d0a3abebf97fe: 'Удалить размер',
  sbba26a884a26c0c7: 'Объявление фиксированного размера (300 x 250)',
  sc5c8140d066b7231: '// Включает методы тега GPT.',
  sc907ffeeafb021d1: 'Настройки выходных данных',
  sccb7f7246c10ecb6: 'Боковое объявление (справа)',
  sd3926a53f7b06107:
    '// Запрашивает и отображает все ранее настроенные рекламные места.',
  sd5ac53cfd233dbcb: 'Ограниченный показ рекламы',
  se6dd79643508bb80: 'Таргетинг',
  se78c02e9a98a0f47: 'Конфиденциальность',
  secff207571282402: 'Межстраничное объявление на сайте',
  sed09c5dfcd2f8bc8: 'Добавить ключ таргетинга',
  sefe480470a2c783c: 'Объявление с вознаграждением',
  sf0cab2483f66aa2e: 'Свое значение',
  sf2057da4d0abd00e: 'Добавить значение таргетинга',
  sf21fb4f4b9e8911f: 'Ширина',
  sf915707accde585c: 'Лица, не достигшие минимального возраста',
  sf93d227444bc5687: 'Настройки страницы',
  sffdadf0a576fd802: 'Высота',
};
