/**
 * Copyright 2025 Google LLC
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

// Do not modify this file by hand!
// Re-generate this file by running lit-localize

import {str} from '@lit/localize';

/* eslint-disable no-irregular-whitespace */
/* eslint-disable @typescript-eslint/no-explicit-any */

export const templates = {
  s00f485d30c4d7069: 'Отключить начальную загрузку',
  s02c64e6a6306c0b0: 'Добавить рекламное место',
  s0536dee760be4bf2: '// Задает настройки конфиденциальности.',
  s06d92c8a54c8a011: 'Шаблон рекламного места',
  s08995feb9716ee48: 'Формат внестраничного объявления',
  s09c694b6602d365d: 'Боковое объявление (слева)',
  s0d576da69783c058: str`${0}: возвращается пустое значение, если страница или устройство не поддерживает их.`,
  s0eb106f4b9813ad3: 'Неперсонализированная реклама',
  s1163c710c6c9bccf: 'Межстраничное объявление в играх',
  s11a3c998dc1af0b1: 'Образцы объявлений',
  s1c1f567a55f86cc2: 'Показ окна',
  s1c67a1fa4d07bd8b: 'URL страницы',
  s1e6dc9c6efd64b15: 'Отключить персонализацию рекламы',
  s23dffb234cd0ff74: 'Slot-level configuration',
  s267a52c34c200ef0: 'Режим единого запроса (РЕЗ)',
  s292d08a9cea72454: 'Объявление гибкого размера',
  s2a071e5a3e79454a: 'Ключ=Значение1,Значение2,…',
  s2d647200b120ea41: 'Путь к рекламному блоку',
  s3132d1a0580760bc: 'Ресурс для детей',
  s3400fb34f1e245a9: 'Объявление с несколькими размерами',
  s352f8b213acc822a: str`${0}: загрузка выполнена.`,
  s3870e706a2084c79: str`Недопустимое значение ключа ${0}: ${1}`,
  s3be169991df10a5d: 'Посмотреть',
  s3e0b42b56e05829d: 'Размеры',
  s4089274c7ce7fb00: 'Согласие пользователей из ЕС',
  s4121536e35beb2ed: 'Объявление фиксированного размера (728 x 90)',
  s417b90913e05bc17: 'Предварительный просмотр',
  s419ce4c474f1f9a8: '// Задать настройки на уровне страницы.',
  s42278ac7b37a5245: 'Добавьте ключи и значения таргетинга',
  s43e9aef7aa01fca9: 'Недоступно',
  s4535f519744108bf: 'Формат вывода',
  s4661d2a8c1259e58: 'Образцы внестраничных объявлений',
  s48390e2c954ba495: 'Объявление фиксированного размера (100 x 100)',
  s49b92d61c8e9e116: 'Укажите действительный URL.',
  s4edecd7e589254c3: 'Ad exclusion labels',
  s53a96edcf36221b2: 'Размеры рекламных мест',
  s5bf3f3d517569ebd: 'Фиксированное объявление (внизу)',
  s5e13187e6961d8b1: '// Определяет внестраничные рекламные места.',
  s5fc316a7f287b7be: 'Просмотр в окне iframe невозможен.',
  s669b18c6d2d9c95b: 'Нет',
  s68fe43baedc49318: 'Обновить предпросмотр',
  s6b0627385c38c206: 'Add an ad exclusion label',
  s6ead833ff5e49608: 'Объявление с учетом рекламных намерений',
  s703415876ae4626f: 'Объявление фиксированного размера (750 x 200)',
  s707a334b3b2a7140: str`${0}. Чтобы выполнить просмотр в отдельном окне, нажмите кнопку ниже.`,
  s710f900ef624e363: 'Фиксированное объявление (вверху)',
  s71e012bd812c44a2: '// Определяет статические рекламные места.',
  s733564cddc33799f:
    'При попытке установить связь со сборщиком образцов тегов GPT произошла ошибка.',
  s758d8c59379ea482: 'Таргетинг на уровне страницы',
  s77b0113eae08368b: 'Образец шаблона',
  s7b5fa742d13b462e: 'Настройки рекламного места',
  s8233e942045a2b50: str`${0} не поддерживается на этой странице.`,
  s85ed67972e8ca8a4: 'Требуется ли согласие на использование хранилища',
  s8a2c4a3aa651b7fb: 'Удалить рекламное место',
  s8e732383cac5c9fd: '100x100,fluid,…',
  s90465cbd227840a3: str`${0} Чтобы активировать, прокрутите страницу.`,
  s96f81f2fccc92df4: '// Регистрирует все ранее настроенные рекламные места.',
  s9919a3c7a0754a26: 'Labels must be 127 characters or less',
  s9d21580cc7643953: str`${0} загружается…`,
  s9dc1289fa45bd694: 'Триггеры межстраничных объявлений',
  sa2b2ab2dd02accfd: 'Клик по ссылке',
  sa9c78a7a0167358f: str`Неуникальный ключ: ${0}`,
  sab590a46db406ca7: 'Укажите действительный путь к рекламному блоку.',
  sb457d189f407a5a6: 'Отказаться от обработки пользовательских данных',
  sb4a18873f72e8f57: str`Недействительный размер: ${0}`,
  sb4fb36c094a78d99: str`Недопустимый ключ: ${0}`,
  sb69b079c821c34c8: 'Защита',
  sb813a33f700541bf:
    'Загрузка диалогового окна для получения согласия пользователей…',
  sbba26a884a26c0c7: 'Объявление фиксированного размера (300 x 250)',
  sc5c8140d066b7231: '// Включает методы тега GPT.',
  sc907ffeeafb021d1: 'Настройки выходных данных',
  sccb7f7246c10ecb6: 'Боковое объявление (справа)',
  sd3926a53f7b06107:
    '// Запрашивает и отображает все ранее настроенные рекламные места.',
  sd4801ff24e6e00e1: str`Нет значения ключа: ${0}`,
  sd5ac53cfd233dbcb: 'Ограниченный показ рекламы',
  sdb90b681e373be33: 'Настройки на уровне страницы',
  sdee10f7d35f52edf: 'Атрибуты AdSense',
  se6dd79643508bb80: 'Таргетинг',
  se78c02e9a98a0f47: 'Конфиденциальность',
  seb61938dbbd0dd2b: 'Навигация в браузере',
  secff207571282402: 'Межстраничное объявление на сайте',
  sefe480470a2c783c: 'Объявление с вознаграждением',
  sf0cab2483f66aa2e: 'Свое значение',
  sf915707accde585c: 'Лица, не достигшие минимального возраста',
  sf93d227444bc5687: 'Настройки страницы',
};
